Repository: LINBIT/linbit-documentation
Catalog: UG9/*/po/drbd-upgrading-8.4-to-9.x.adoc.po
Languages: to

source: Upgrading DRBD From 8.4 to 9.x
to: DRBDを8.4から9.xにアップグレードする

source: This section covers the process of upgrading DRBD from version 8.4.x to 9.x in detail. For upgrades within version 9, and for special considerations when upgrading to a particular DRBD 9.x version, refer to the <<drbd-upgrading.adoc#s-upgrading-drbd, Upgrading DRBD>> chapter in this guide.
to: このセクションでは、DRBDをバージョン8.4.xから9.xにアップグレードするプロセスについて詳しく説明します。バージョン9内でのアップグレードや特定のDRBD 9.xバージョンにアップグレードする際の特別な考慮事項については、このガイドの <<drbd-upgrading.adoc#s-upgrading-drbd, 「DRBDのアップグレード」D>> 章を参照してください。

source: Compatibility
to: 互換性

source: DRBD 9.a.b releases are generally protocol compatible with DRBD 8.c.d. In particular, all DRBD 9.a.b releases other than DRBD 9.1.0 to 9.1.7 inclusive are compatible with DRBD 8.c.d.
to: DRBD 9.a.bのリリースは一般的にDRBD 8.c.dとプロトコル互換性があります。特に、DRBD 9.a.bのすべてのリリースが、DRBD 8.c.dと互換性があることが示されていますが、DRBD 9.1.0から9.1.7までのリリースは互換性がありません。

source: General Overview
to: 一般的な概要

source: The general process for upgrading 8.4 to 9.x is as follows:
to: 8.4から9.xへのアップグレードの一般的な手順は以下の通りです:

source: Configure the <<s-updating-your-repo-v8-to-v9,new repositories>> (if using packages from LINBIT).
to: LINBIT のパッケージを使用している場合、<<s-updating-your-repo-v8-to-v9,新しいリポジトリ>> を設定してください。

source: Verify that the current situation <<s-upgrade-check-v8-to-v9,is okay>>.
to: 現在の状況が <<s-upgrade-check-v8-to-v9,問題ないこと>> を確認してください。

source: <<s-upgrade-pausing-the-cluster-v8-to-v9,Pause>> any cluster manager.
to: クラスターマネージャーを <<s-upgrade-pausing-the-cluster-v8-to-v9,一時停止>> してください。

source: Upgrade packages to install <<s-upgrading-the-packages-v8-to-v9,new versions>> .
to: <<s-upgrading-the-packages-v8-to-v9,新しいバージョン>> 新しいバージョンをインストールするためにパッケージをアップグレードしてください。

source: If you want to move to more than two nodes, you will need to resize the lower-level storage to provide room for the additional metadata. This topic is discussed in the <<ch-lvm,LVM Chapter>>.
to: 2つ以上のノードに移動したい場合は、追加のメタデータのためのスペースを確保するために、下位レベルのストレージをリサイズする必要があります。このトピックについては、 <<ch-lvm,「LVM 章」>> で詳しく説明されています。

source: Unconfigure resources, unload DRBD 8.4, and <<s-upgrade-reload-kernel-mod-v8-to-v9,load the v9 kernel module>>.
to: リソースの設定を無効にし、DRBD 8.4 をアンロードし、<<s-upgrade-reload-kernel-mod-v8-to-v9,v9 カーネルモジュールをロード>> してください。

source: <<s-upgrade-convert-v8-to-v9,Convert DRBD metadata>> to format `v09`, perhaps changing the number of bitmaps in the same step.
to: <<s-upgrade-convert-v8-to-v9,DRBDのメタデータ>> をv09形式に変換し、同時にビットマップの数を変更することもできます。

source: <<s-upgrade-start-drbd-v8-to-v9,Start the DRBD resources>> and bring the cluster node _online_ again if you are using a cluster manager.
to: クラスターマネージャーを使用している場合は、<<s-upgrade-start-drbd-v8-to-v9, DRBDリソースを開始し>> 、クラスターノードを再び_オンライン_にします。

source: Updating Your Repository
to: リポジトリを更新する

source: Due to the number of changes between the 8.4 and 9.x branches, LINBIT has created separate repositories for each. The best way to get LINBIT's software installed on your machines, if you have a LINBIT customer or evaluation account, is to download a small https://my.linbit.com/linbit-manage-node.py[Python helper script] and run it on your target machines.
to: LINBITは、8.4と9.xブランチの間の変更が多いため、それぞれに個別のリポジトリを作成しました。LINBITのソフトウェアをお使いのマシンにインストールする最良の方法は、LINBITの顧客または評価アカウントをお持ちの場合、https://my.linbit.com/linbit-manage-node.py[Pythonヘルパースクリプト]をダウンロードして、対象のマシンで実行することです。

source: Using the LINBIT Manage Node Helper Script to Enable LINBIT Repositories
to: LINBITリポジトリの有効化にはLINBIT Manage Node Helperスクリプトを使用します。

source: Running the LINBIT helper script will allow you to enable certain LINBIT package repositories. When upgrading from DRBD 8.4, it is recommended that you enable the `drbd-9` package repository.
to: LINBITのヘルパースクリプトを実行することで、特定のLINBITパッケージリポジトリを有効にすることができます。DRBD 8.4からアップグレードする際には、`drbd-9`パッケージリポジトリを有効にすることをお勧めします。

source: While the helper script does give you the option of enabling a `drbd-9.0` package repository, this is not recommended as a way to upgrade from DRBD 8.4, as that branch only contains DRBD 9.0 and related software. It will likely be discontinued in the future and the DRBD versions 9.1+ that are available in the `drbd-9` package repository are protocol compatible with version 8.4.
to: ヘルパースクリプトには、`drbd-9.0` パッケージリポジトリを有効にするオプションがありますが、これは DRBD 8.4 からアップグレードするための推奨される方法ではありません。なぜなら、そのブランチには DRBD 9.0 および関連ソフトウェアしか含まれていないからです。将来的にはおそらく廃止され、`drbd-9` パッケージリポジトリで利用できる DRBD バージョン 9.1 以降は、バージョン 8.4 とプロトコル互換性があります。

source: To use the script to enable the `drbd-9` repository, refer to the instructions in this guide for <<drbd-install-packages.adoc#s-linbit-manage-node-script, Using a LINBIT Helper Script to Register Nodes and Configure Package Repositories>>
to: `drbd-9`リポジトリを有効化するためにスクリプトを使用するには、このガイド内の指示を参照してください。<<drbd-install-packages.adoc#s-linbit-manage-node-script, 「LINBITヘルパースクリプトを使用してノードを登録しパッケージリポジトリを構成する方法」>> のセクションを参照してください。

source: Debian/Ubuntu Systems
to: Debian/Ubuntuシステム

source: When using LINBIT package repositories to update DRBD 8.4 to 9.1+, note that LINBIT currently only keeps two LTS Ubuntu versions up-to-date: Focal (20.04) and Jammy (22.04). If you are running DRBD v8.4, you are likely on an older version of Ubuntu Linux than these. Before using the helper script to add LINBIT package repositories to update DRBD, you would first need to update your system to a LINBIT supported LTS version.
to: LINBITパッケージリポジトリを使用して、DRBD 8.4から9.1以上に更新する際には、LINBITは現在、ただ2つのLTS Ubuntuバージョン、つまりFocal（20.04）とJammy（22.04）のみを最新状態に保っています。DRBD v8.4を実行している場合、おそらくこれらよりも古いバージョンのUbuntu Linuxを使用しているでしょう。DRBDパッケージリポジトリを追加してDRBDを更新するためのヘルパースクリプトを使用する前に、あなたのシステムをLINBITがサポートするLTSバージョンに更新する必要があります。

source: Checking the DRBD State
to: DRBDの状態を確認する

source: Before you update DRBD, verify that your resources are in sync. The output of `cat /proc/drbd` should show an _UpToDate/UpToDate_ status for your resources.
to: DRBDを更新する前に、リソースが同期しているか確認してください。`cat /proc/drbd`の出力には、リソースが「UpToDate/UpToDate」の状態であることが表示されるはずです。

source: Pausing the Services
to: サービスの一時停止

source: Now that you know the resources are in sync, start by upgrading the secondary node. This can be done manually or according to your cluster manager's documentation.
to: リソースが同期されていることがわかったので、まずはセカンダリーノードのアップグレードを開始してください。これは、手動で行うか、クラスターマネージャーのドキュメントに従って行うことができます。

source: Both processes are covered below. If you are running Pacemaker as your cluster manager do not use the manual method.
to: 両方の手順について以下で説明します。クラスタマネージャーとしてPacemakerを使用している場合は、手動方法を使用しないでください。

source: Manual Method
to: 手動方法

source: To use the `systemctl stop` command with a DRBD resource target, you would have needed to have enabled the `drbd.service` previously. You can verify this by using the `systemctl is-enabled drbd.service` command.
to: DRBDリソースターゲットを使用して`systemctl stop`コマンドを実行するには、事前に`drbd.service`を有効にしておく必要があります。これを確認するには、`systemctl is-enabled drbd.service`コマンドを使用することができます。

source: Put the secondary node into standby mode. In this example `node-2` is secondary.
to: セカンダリノードを待機モードにします。この例では、`node-2` が副次ノードです。

source: You can watch the status of your cluster using `crm_mon -rf` or watch `cat /proc/drbd` until it shows _Unconfigured_ for your resources.
to: クラスターの状態を確認するには、`crm_mon -rf`を使用するか、リソースが「_Unconfigured_」と表示されるまで`cat /proc/drbd`を見ることができます。

source: Upgrading the Packages
to: パッケージのアップグレード

source: Now update your packages.
to: パッケージの更新

source: Once the upgrade is finished you will have the latest DRBD 9.x kernel module and `drbd-utils` installed on your secondary node, `node-2`.
to: アップグレードが完了すると、セカンダリノードである「node-2」に最新のDRBD 9.xカーネルモジュールと「drbd-utils」がインストールされます。

source: But the kernel module is not active yet.
to: ただし、カーネルモジュールはまだアクティブではありません。

source: Loading the New Kernel Module
to: 新しいカーネルモジュールの読み込み

source: By now the DRBD module should not be in use anymore, so unload it by entering the following command:
to: 現時点では、もはやDRBDモジュールを使用していないはずなので、次のコマンドを入力してアンロードしてください：

source: If there is a message like `ERROR: Module drbd is in use`, then not all resources have been correctly stopped.
to: もし `ERROR: Module drbd is in use` のようなメッセージが表示される場合、すべてのリソースが正しく停止されていない可能性があります。

source: Retry <<s-upgrading-the-packages-v8-to-v9, upgrading packages>>, or run the command `drbdadm down all` to find out which resources are still active.
to: <<s-upgrading-the-packages-v8-to-v9、パッケージのアップグレード>> を再試行するか、コマンド`drbdadm down all`を実行して、まだアクティブなリソースを特定してください。

source: Some typical issues that might prevent you from unloading the kernel module are:
to: カーネルモジュールをアンロードする際に起こりうる一般的な問題には、次のようなものがあります。

source: NFS export on a DRBD-backed filesystem (see `exportfs -v` output)
to: DRBDでバックアップされたファイルシステムに対するNFSのエクスポート（`exportfs -v`の出力を参照）

source: Filesystem still mounted - check `grep drbd /proc/mounts`
to: ファイルシステムはまだマウントされています。`grep drbd /proc/mounts`をチェックしてください。

source: Loopback device active (`losetup -l`)
to: ループバックデバイスがアクティブです (`losetup -l`)

source: Device mapper using DRBD, directly or indirectly (`dmsetup ls --tree`)
to: Device Mapperを使用して、DRBDを直接または間接的に利用しています（`dmsetup ls --tree`）。

source: LVM with a DRBD-PV (`pvs`)
to: LVMとDRBD-PV（`pvs`）

source: This list is not complete. These are just the most common examples.
to: このリストは完全ではありません。これらは単なる最も一般的な例に過ぎません。

source: Now you can load the new DRBD module.
to: 新しいDRBDモジュールをロードすることができます。

source: Next, you can verify that the version of the DRBD kernel module that is loaded is the updated 9.x version. If the installed package is for the wrong kernel version, the `modprobe` would be successful, but output from a `drbdadm --version` command would show that the DRBD kernel version (`DRBD_KERNEL_VERSION_CODE`) was still at the older 8.4 (`0x08040` in hexadecimal) version.
to: 次に、ロードされているDRBDカーネルモジュールのバージョンが更新された9.xバージョンであることを確認できます。インストールされたパッケージが誤ったカーネルバージョン向けである場合、`modprobe`は成功するものの、`drbdadm --version` コマンドの出力によって、DRBDカーネルバージョン (`DRBD_KERNEL_VERSION_CODE`) がまだ古い8.4（16進数では `0x08040`）バージョンであることがわかります。

source: The output of `drbdadm --version` should show 9.x.y and look similar to this:
to: `drbdadm --version` の出力には、9.x.y と表示され、次のような形式になるべきです。

source: On the primary node, `node-1`, `drbdadm --version` will still show the
to: メインのノードである `node-1` では、`drbdadm --version` を実行すると、引き続き次の情報が表示されます。

source: Migrating Your Configuration Files
to: 設定ファイルの移行

source: DRBD 9.x is backward compatible with the 8.4 configuration files; however, some syntax has changed. See <<s-recent-changes-config>> for a full list of changes. In the meantime you can port your old configs fairly easily by using `drbdadm dump all` command. This will output both a new global configuration followed by the new resource configuration files. Take this output and make changes accordingly.
to: DRBD 9.x は、8.4 の設定ファイルと互換性がありますが、一部の文法が変更されています。変更の詳細については、変更点の一覧にある <<s-recent-changes-config>> を参照してください。一方、`drbdadm dump all` コマンドを使用することで、古い設定を比較的簡単に移行することができます。これにより、新しいグローバル設定とそれに続く新しいリソース設定ファイルが出力されます。この出力を使用して、適切な変更を行ってください。

source: Changing the Metadata
to: メタデータの変更

source: Now you need to convert the on-disk metadata to the new version. You can do this by using the `drbdadm create-md` command and answering two questions.
to: 今、ディスク上のメタデータを新しいバージョンに変換する必要があります。これは、`drbdadm create-md`コマンドを使用して、2つの質問に答えることで行うことができます。

source: If you want to change the number of nodes, you should already have increased the size of the lower level device, so that there is enough space to store the additional bitmaps; in that case, you would run the command below with an additional argument `--max-peers=__<N>__`. When determining the number of (possible) peers please take setups like the <<s-drbd-client>> into account.
to: ノード数を変更したい場合は、既に下位のデバイスのサイズを増やしている必要があります。追加のビットマップを保存する十分なスペースが確保されているということです。その場合は、以下のコマンドに追加の引数 `--max-peers=__<N>__` を付けて実行してください。可能なピアの数を決定する際には、<<s-drbd-client>> のような設定も考慮してください。

source: The order of these arguments is important. Make sure you understand the potential data loss implications of this command before you enter it.
to: これらの引数の順序は重要です。このコマンドの可能性としてのデータ損失の影響を理解してから入力してください。

source: Starting DRBD Again
to: DRBDを再起動します

source: Now, the only thing left to do is to get the DRBD devices up and running again. You can do this by using the `drbdadm up all` command.
to: 今すべきことは、DRBD デバイスを再稼働させることです。これは、`drbdadm up all` コマンドを使用して行うことができます。

source: Next, depending on whether you are using a cluster manager or if you keep track of your DRBD resources manually, there are two different ways to bring up your resources. If you are using a cluster manager follow its documentation.
to: 次に、クラスターマネージャーを使用しているか、DRBDリソースを手動で追跡しているかによって、リソースを起動する方法が2つあります。クラスターマネージャーを使用している場合は、そのドキュメントに従ってください。

source: Manually
to: 手動操作

source: This should make DRBD connect to the other node, and the resynchronization process will start.
to: これにより、DRBDが他のノードに接続され、再同期プロセスが開始されます。

source: When the two nodes are _UpToDate_ on all resources again, you can move your applications to the already upgraded node (here `node-2`), and then follow the same steps on the cluster node still running version 8.4.
to: 両ノードのリソースが再度「UpToDate」となった時点で、アプリケーションをすでにアップグレードされたノード（`node-2` ここでは）に移動し、その後、引き続きバージョン8.4を実行しているクラスターノードで同じ手順を実行してください。
